In [1]:
import pandas as pd
import mysql.connector as sql

con = sql.connect(host='localhost', user='root', password='mysql@dev', database='imdb')
print(con)

def query(q):
    return pd.read_sql_query(q, con)

<mysql.connector.connection.MySQLConnection object at 0x000002257773E188>

# Aggregate Functions: COUNT, MIN, MAX, SUM, AVG
Computes a single value on a set of rows and returns the aggregate.

In [2]:
query("SELECT MIN(year) FROM movies;")

   MIN(year)
0       1888

In [3]:
query("SELECT MAX(year) FROM movies;")

   MAX(year)
0       2008

In [4]:
query("SELECT COUNT(*) FROM movies;")

   COUNT(*)
0    388269

In [5]:
query("SELECT COUNT(rankscore) FROM movies;")

   COUNT(rankscore)
0             67245

In [6]:
query("SELECT COUNT(id) FROM movies;")

   COUNT(id)
0     388269